tutorials/viscoelastic/viscoelasticFluidFoam/XPP_SE/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          120;
        startFace       44580;
    }
    fixedWalls
    {
        type            wall;
        nFaces          390;
        startFace       44700;
    }
    outlet
    {
        type            patch;
        nFaces          30;
        startFace       45090;
    }
    simetry
    {
        type            symmetryPlane;
        nFaces          300;
        startFace       45120;
    }
    frontAndBack
    {
        type            empty;
        nFaces          45000;
        startFace       45420;
    }
)

// ************************************************************************* //
